"""
Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

#От себя добавил чтение и запись в файл.
"""
""" 
data = open('/home/pablo/Documents/Python GB/Block_2_Python/webinar_5/webinar_5_task_1.txt','r')
txt_1=data.readline()
print(txt_1)
list_1 = txt_1.split(' ')
fragment = 'абв'
new_list = []
for word in list_1:
    if fragment not in word:
        new_list.append(word)
new_txt=' '.join(new_list)
print(new_txt)

with open('/home/pablo/Documents/Python GB/Block_2_Python/webinar_5/webinar_5_task_1_result.txt', 'w') as data1:
    data1.writelines(new_txt) 
"""


