"""
Task 1
Напишите программу, которая принимает на вход цифру, 
обозначающую день недели, и проверяет, является ли этот день выходным.
Пример:
- 6 -> да
- 7 -> да
- 1 -> нет

print('Please input your number of the day :')
a = int(input())
if a == (6 or 7):
    print('This is the weekend!')
else:
    a == range(6)
    print('This is work day!')
"""

"""
Task 2
Напишите программу для. проверки истинности утверждения 
¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
"""
